<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
</head>
<body>
  <h4> «Дорога в будущее» </h4> <h6> Книга, написанная Биллом Гейтсом, соучредителем и бывшим генеральным директором Microsoft; Натаном Мирволдом, руководителем Microsoft; и бывшим вице-президентом Microsoft Питером Райнерсоном. Книга, опубликованная в ноябре 1995 года, а затем существенно переработанная примерно год спустя, «Дорога в будущее» обобщает последствия революции персональных компьютеров и описывает будущее, которое сильно изменится с появлением глобальной информационной магистрали. </h6>
  <h6> Гейтс получил аванс в размере 2,5 миллиона долларов за свою книгу и деньги от продажи дополнительных прав; [2] все вырученные средства были пожертвованы на «поощрение использования технологий в образовании через Национальный фонд улучшения образования», [3] фонд, созданный Национальной ассоциацией образования. [4] </h6>
  <h5> Различия в содержании между изданиями в твердом переплете и торговыми изданиями </h5>
  <h6> В издании в твердом переплете Интернет рассматривался как один из "важных предшественников информационной магистрали ... указывающий на [ее] будущее" (стр. 89);[3] он отметил, что "популярность Интернета - это самое важное событие в мире вычислительной техники с тех пор, как в 1981 году был представлен IBM PC"[3] (стр. 91), но "сегодняшний Интернет - это не информационная магистраль, как я себе представляю, хотя вы можете думать о нем как о начале магистрали": информационная магистраль, по его замыслу, должна была бы стать отличаться от Интернета так же сильно, как Орегонская тропа отличалась от межштатной автомагистрали 84.[3] (стр. 95) </h6>
  <h6> Переработанное издание было опубликовано в октябре 1996 года в мягкой обложке [5] с подзаголовком «Полностью переработанное и дополненное». </h6>
  <h6> Оба издания поставлялись с компакт-диском, содержащим текст книги и дополнительную информацию. Книга в твёрдом переплёте была издана компанией Viking, а в мягкой обложке — компанией Penguin, дочерним предприятием Viking. Многие издательства по всему миру выпустили переводные версии книги. </h6>
  <h5> Соавторы </h5>
  <h6> Один из соавторов Гейтса, Натан Мирволд, был учёным-компьютерщиком и вице-президентом Microsoft, который какое-то время руководил исследовательской деятельностью Microsoft, а затем стал соучредителем Intellectual Ventures, компании по интеллектуальной собственности. Другой соавтор, Питер Райнерсон, был лауреатом Пулитцеровской премии и предпринимателем, который позже основал и продал интернет-компанию и стал вице-президентом Microsoft. </h6>
  <h5> Источники </h5>
  <h6> Гейтс, Билл (1996). «Дорога в будущее». Penguin Books. ISBN 0670772895. Что такое информационная магистраль? Как новые технологии изменят нашу жизнь? Нужно ли мне учиться пользоваться компьютером? Станет ли моя работа ненужной? Добро пожаловать в «Дорогу в будущее»... </h6>
  <h6> Билл Гейтс (24 ноября 2020 г.). «Дорога в будущее спустя 25 лет. Прогнозы, которые я сделал верно и неверно в своей первой книге». www.gatesnotes.com. Архивировано из оригинала 23 мая 2021 г.. Получено23 мая 2021 г.. </h6>
</body>
</html>
