<!DOCTYPE html>
<html>
<head>
    <title>Определение знака зодиака</title>
</head>
<body>
    <form method="post"> <!-- метод отправки данных -->
        <input type="text" name="date" pattern="\d{2}\.\d{2}\.\d{4}"> <!-- проверка формата ввода -->
    </form>
    <?php
    if (!empty($_POST["date"])) { //проверка на непустое в массиве POST
        if (preg_match('/^\d{2}\.\d{2}\.\d{4}$/', $_POST["date"])) { //проверка строки по выражению
            $parts = explode('.', $_POST["date"]); 
            $d = $parts[0];
            $m = $parts[1];
            $y = $parts[2];
            if (checkdate($m, $d, $y)) { 
                $sign = match(true) {
                    ($m == 1 && $d >= 20) || ($m == 2 && $d <= 18) => 'Водолей',
                    ($m == 2 && $d >= 19) || ($m == 3 && $d <= 20) => 'Рыбы',
                    ($m == 3 && $d >= 21) || ($m == 4 && $d <= 19) => 'Овен',
                    ($m == 4 && $d >= 20) || ($m == 5 && $d <= 20) => 'Телец',
                    ($m == 5 && $d >= 21) || ($m == 6 && $d <= 20) => 'Близнецы',
                    ($m == 6 && $d >= 21) || ($m == 7 && $d <= 22) => 'Рак',
                    ($m == 7 && $d >= 23) || ($m == 8 && $d <= 22) => 'Лев',
                    ($m == 8 && $d >= 23) || ($m == 9 && $d <= 22) => 'Дева',
                    ($m == 9 && $d >= 23) || ($m == 10 && $d <= 22) => 'Весы',
                    ($m == 10 && $d >= 23) || ($m == 11 && $d <= 21) => 'Скорпион',
                    ($m == 11 && $d >= 22) || ($m == 12 && $d <= 21) => 'Стрелец',
                    ($m == 12 && $d >= 22) || ($m == 1 && $d <= 19) => 'Козерог',
                };
                echo "<p>Ваш знак: <b>$sign</b></p>";
            } else {
                echo "<p>Некорректная дата!</p>";
            }
        } else {
            echo "<p>Используйте формат ДД.ММ.ГГГГ</p>";
        }
    }
    ?>
</body>
</html>